{
 "Learn how to configure and utilize the Import module for handling data ingestion from API calls and CSV files.": "APIコールとCSVファイルからのデータ取り込みを扱う、Importモジュールの設定と利用方法を学びます。",
  "Import": "インポート",
  "The Import package provides a comprehensive and extensible framework for managing data import tasks within the MBC CQRS Serverless ecosystem. It enables": "Importパッケージは、MBC CQRS Serverlessエコシステム内でデータインポートタスクを管理するための、包括的で拡張可能なフレームワークを提供します。これにより、以下のことが可能になります：",
  "Unified data processing from multiple sources (API, CSV).": "複数のソース（API、CSV）からの一元的なデータ処理。",
  "Fully customizable logic via a two-phase strategy pattern.": "2フェーズのストラテジーパターンによる、完全にカスタマイズ可能なロジック。",
  "Asynchronous, event-driven execution for scalability.": "スケーラビリティのための非同期・イベント駆動型の実行。",
  "Dual processing modes for CSV files (Direct vs. Step Function).": "CSVファイルに対する2つの処理モード（Direct vs. Step Function）。",
  "Auditing and result tracking for all import operations.": "すべてのインポート操作に対する監査と結果の追跡。",
  "Installation": "インストール",
  "Core concept": "コアコンセプト",
  "The module operates on a two-phase architecture, separating initial data ingestion from the final business logic.": "このモジュールは、初期のデータ取り込みと最終的なビジネスロジックを分離する、2フェーズのアーキテクチャで動作します。",
  "Import Phase (`IImportStrategy`): This is the entry point. Its role is to take raw data (from a JSON object or a CSV row), **transform** it into a standardized DTO, and **validate** it.": "インポートフェーズ (`IImportStrategy`): これはエントリーポイントです。その役割は、生データ（JSONオブジェクトまたはCSVの行から）を受け取り、それを標準化されたDTOに**変換**し、**検証**することです。",
  "Process Phase (`IProcessStrategy`): This is the business logic core. It takes the validated DTO from the temporary table, **compares** it with existing data, and **maps** it into a final command payload for creation or update.": "プロセスフェーズ (`IProcessStrategy`): これはビジネスロジックの中核です。一時テーブルから検証済みのDTOを受け取り、既存のデータと**比較**し、作成または更新のための最終的なコマンドペイロードに**マッピング**します。",
  "Usage": "使用方法",
  "Here is a step-by-step guide to configure the module for a Policy entity.": "Policyエンティティ用にモジュールを設定するためのステップバイステップガイドです。",
  "Implement the Import Strategy": "インポートストラテジーの実装",
  "This class handles the initial transformation and validation of incoming data.": "このクラスは、入力データの初期変換と検証を処理します。",
  "Implement the Process Strategy": "プロセスストラテジーの実装",
  "This class contains the core business logic for comparing and mapping the data.": "このクラスは、データを比較およびマッピングするためのコアビジネスロジックを含みます。",
  "Create a Domain Module": "ドメインモジュールの作成",
  "Create a module to provide and export your strategy classes.": "ストラテジークラスを提供およびエクスポートするためのモジュールを作成します。",
  "Custom event factory": "カスタムイベントファクトリ",
  "Configure the `ImportModule`": "`ImportModule`の設定",
  "In your root `AppModule` or a dedicated feature module, register the `ImportModule` and provide your profiles.": "ルートの`AppModule`または専用のフィーチャーモジュールで、`ImportModule`を登録し、プロファイルを提供します。"
}