{
  "Import": "インポート",
  "A flexible and extensible module for handling data import within the MBC CQRS Serverless framework.": "MBC CQRS Serverlessフレームワーク内でデータインポートを処理するための柔軟で拡張可能なモジュールです。",
  "Installation": "インストール",
  "Overview": "概要",
  "The Import module provides a unified approach to data ingestion from multiple sources, including REST APIs and CSV files. It implements a two-phase architecture for clean separation between data ingestion and business logic execution.": "インポートモジュールは、REST APIやCSVファイルなど複数のソースからのデータ取り込みに対する統一的なアプローチを提供します。データ取り込みとビジネスロジック実行の間のクリーンな分離のために2フェーズアーキテクチャを実装しています。",
  "Core Features": "主な機能",
  "Unified Architectural Design": "統一アーキテクチャ設計",
  "Process data from REST API endpoints and CSV files through a single, consistent set of core business logic": "単一の一貫したコアビジネスロジックを通じてREST APIエンドポイントとCSVファイルからのデータを処理",
  "Strategy Pattern": "ストラテジーパターン",
  "Customize validation, transformation, and processing logic for each data entity via NestJS providers": "NestJSプロバイダーを通じて各データエンティティのバリデーション、変換、処理ロジックをカスタマイズ",
  "Asynchronous Processing": "非同期処理",
  "Event-driven processing through DynamoDB Streams, SNS, and SQS for maximum scalability": "最大限のスケーラビリティのためにDynamoDB Streams、SNS、SQSを通じたイベント駆動処理",
  "Biphasic Processing": "2フェーズ処理",
  "Clear separation between data ingestion/validation and business logic execution": "データ取り込み/バリデーションとビジネスロジック実行の明確な分離",
  "Dual CSV Modes": "デュアルCSVモード",
  "Choose between DIRECT processing for smaller files or STEP_FUNCTION workflow for large-scale imports": "小さいファイル用のDIRECT処理か大規模インポート用のSTEP_FUNCTIONワークフローを選択",
  "Architecture": "アーキテクチャ",
  "The module operates on a two-phase architecture:": "モジュールは2フェーズアーキテクチャで動作します：",
  "Phase 1: Import (Ingestion)": "フェーズ1：インポート（取り込み）",
  "This phase handles getting data into the system using the `IImportStrategy` interface:": "このフェーズは`IImportStrategy`インターフェースを使用してシステムにデータを取り込みます：",
  "Transform raw input (JSON body or CSV row) into a standardized, validated DTO": "生の入力（JSONボディまたはCSV行）を標準化され検証されたDTOに変換",
  "Validate the transformed DTO": "変換されたDTOをバリデート",
  "The result is a record in a temporary DynamoDB table with CREATED status.": "結果はCREATEDステータスで一時DynamoDBテーブルのレコードになります。",
  "Phase 2: Process (Business Logic)": "フェーズ2：処理（ビジネスロジック）",
  "Once a record is in the temporary table, an event triggers this phase using the `IProcessStrategy` interface:": "レコードが一時テーブルに入ると、`IProcessStrategy`インターフェースを使用してこのフェーズがトリガーされます：",
  "Compare data with the final destination to determine status (NOT_EXIST, CHANGED, EQUAL)": "最終目的地とデータを比較してステータスを決定（NOT_EXIST、CHANGED、EQUAL）",
  "Construct the final payload for create or update command": "作成または更新コマンドの最終ペイロードを構築",
  "Provide the correct CommandService to execute the write operation": "書き込み操作を実行するための正しいCommandServiceを提供",
  "After processing, the temporary record is updated to COMPLETED or FAILED.": "処理後、一時レコードはCOMPLETEDまたはFAILEDに更新されます。",
  "Basic Setup": "基本セットアップ",
  "Module Configuration": "モジュール設定",
  "Implementing Import Strategy": "インポートストラテジーの実装",
  "Create a custom import strategy for your entity:": "エンティティ用のカスタムインポートストラテジーを作成：",
  "Implementing Process Strategy": "プロセスストラテジーの実装",
  "Create a custom process strategy for your entity:": "エンティティ用のカスタムプロセスストラテジーを作成：",
  "CSV Import": "CSVインポート",
  "Direct Mode": "ダイレクトモード",
  "For smaller CSV files, use direct processing:": "小さいCSVファイルにはダイレクト処理を使用：",
  "Step Function Mode": "Step Functionモード",
  "For large-scale imports, use Step Function workflow:": "大規模インポートにはStep Functionワークフローを使用：",
  "REST API Import": "REST APIインポート",
  "Import data from REST API endpoints:": "REST APIエンドポイントからデータをインポート：",
  "Import Status": "インポートステータス",
  "Track import progress and status:": "インポートの進行状況とステータスを追跡：",
  "Status": "ステータス",
  "Description": "説明",
  "Record created in staging table": "ステージングテーブルにレコードが作成された",
  "Record is being processed": "レコードが処理中",
  "Successfully processed": "正常に処理完了",
  "Processing failed": "処理失敗",
  "Skipped (no changes detected)": "スキップ（変更なし）",
  "Error Handling": "エラー処理",
  "The module provides detailed error information for failed imports:": "モジュールは失敗したインポートの詳細なエラー情報を提供します：",
  "Best Practices": "ベストプラクティス",
  "Validation First": "バリデーション優先",
  "Implement thorough validation in the transform phase to catch errors early": "変換フェーズで徹底的なバリデーションを実装してエラーを早期に検出",
  "Idempotent Processing": "べき等処理",
  "Design process strategies to handle duplicate imports gracefully": "重複インポートを適切に処理するプロセスストラテジーを設計",
  "Use Step Functions for Large Files": "大きなファイルにはStep Functionsを使用",
  "For CSV files with thousands of rows, use STEP_FUNCTION mode": "数千行のCSVファイルにはSTEP_FUNCTIONモードを使用",
  "Monitor Progress": "進行状況の監視",
  "Use the status tracking to monitor long-running imports": "長時間実行インポートを監視するためにステータス追跡を使用",
  "Error Recovery": "エラー回復",
  "Implement retry logic for transient failures": "一時的な障害に対するリトライロジックを実装"
}
