{
  "Architecture": "アーキテクチャ",
  "Settings Hierarchy": "設定の階層",
  "COMMON": "共通",
  "Tenant": "テナント",
  "Group": "グループ",
  "User": "ユーザー",
  "Master Data": "マスターデータ",
  "MasterDataService": "MasterDataService",
  "Code Tables": "コードテーブル",
  "Categories": "カテゴリ",
  "Lookup Values": "ルックアップ値",
  "Learn about the Master Service for managing master data and settings in a multi-tenant environment.": "マルチテナント環境でのマスターデータと設定を管理するためのマスターサービスについて学びます。",
  "Master": "マスターモジュール",
  "The Master Service provides functionality for managing master data and settings in a multi-tenant environment": "マスターサービスは、マルチテナント環境でのマスターデータと設定の管理機能を提供します。",
  "Overview": "概要",
  "The Master Service consists of two main components:": "マスターサービスは2つの主要コンポーネントで構成されています。",
  "Implements hierarchical settings management": "階層的な設定管理を実装",
  "Supports creation of settings at all levels": "すべてのレベルでの設定作成をサポート",
  "Provides update and delete operations for tenant settings": "テナント設定の更新および削除操作を提供",
  "Implements cascading settings retrieval": "階層的な設定取得を実装",
  "Master Data Service": "マスターデータサービス",
  "Implements CRUD operations for master data entities": "マスターデータエンティティのCRUD操作を実装",
  "Provides list and retrieval functionality": "リストおよび取得機能を提供",
  "Includes code validation capabilities": "コード検証機能を含む",
  "Ensures data integrity across tenant boundaries": "テナント間のデータ整合性を確保",
  "Installation": "インストール",
  "Basic Usage": "基本的な使い方",
  "The solution for customizing the behavior of the `MasterModule` is to pass it an options `object` in the static `register()` method.": "`MasterModule` の動作をカスタマイズするには、静的な `register()` メソッドでオプションの `object` を渡します。",
  "Module Options": "モジュールオプション",
  "Option": "オプション",
  "Type": "型",
  "Description": "説明",
  "Enable or disable default master controller": "デフォルトのマスターコントローラーを有効または無効にする",
  "Optional handlers to sync master data to external systems (e.g., RDS)": "マスターデータを外部システム（例：RDS）に同期するオプションハンドラー",
  "Optional Prisma service for RDS-backed queries": "RDSバッククエリ用のオプションPrismaサービス",
  "API Reference": "APIリファレンス",
  "MasterSettingService": "マスター設定サービス",
  "The MasterSettingService interface manages settings at various levels user, group, tenant, common. It allows retrieving, updating, creating, and deleting settings.": "MasterSettingService インターフェースは、ユーザー、グループ、テナント、共通のさまざまなレベルで設定を管理します。設定の取得、更新、作成、削除を可能にします。",
  "Retrieves a specific setting based on the provided setting code.": "指定された設定コードに基づいて特定の設定を取得します。",
  "Creates a common tenant setting that is shared across the system.": "システム全体で共有される共通のテナント設定を作成します。",
  "Creates a tenant-specific setting.": "テナント固有の設定を作成します。",
  "Creates a group-specific setting within a tenant.": "テナント内でグループ固有の設定を作成します。",
  "Creates a user-specific setting within a tenant.": "テナント内でユーザー固有の設定を作成します。",
  "Updates an existing setting.": "既存の設定を更新します。",
  "Deletes a specific setting based on the provided key.": "指定されたキーに基づいて特定の設定を削除します。",
  "Lists master settings with pagination and filtering. Requires RDS (Prisma) configuration.": "ページネーションとフィルタリングでマスター設定をリストします。RDS（Prisma）の設定が必要です。",
  "Partial match for name": "名前の部分一致",
  "Partial match for code": "コードの部分一致",
  "Search in description": "説明文を検索",
  "Retrieves detailed master setting. Throws NotFoundException if not found.": "詳細なマスター設定を取得します。見つからない場合はNotFoundExceptionをスローします。",
  "Creates a new tenant setting. Wrapper for createTenantSetting with automatic tenant code extraction from context.": "新しいテナント設定を作成します。コンテキストからテナントコードを自動抽出するcreateTenantSettingのラッパーです。",
  "Creates multiple settings at once.": "複数の設定を一度に作成します。",
  "Updates a master setting.": "マスター設定を更新します。",
  "Deletes a master setting. Wrapper for deleteSetting.": "マスター設定を削除します。deleteSettingのラッパーです。",
  "Checks if a setting code already exists for the current tenant.": "現在のテナントに設定コードが既に存在するかどうかを確認します。",
  "Handle duplicate code": "重複コードの処理",
  "Copies master settings and data to other tenants asynchronously using Step Functions. This is useful for initializing new tenants with existing master data.": "Step Functionsを使用して、マスター設定とデータを他のテナントに非同期でコピーします。既存のマスターデータで新しいテナントを初期化するのに便利です。",
  "or DataCopyMode.PARTIAL": "またはDataCopyMode.PARTIAL",
  "Required when mode is PARTIAL": "modeがPARTIALの場合は必須",
  "Returns a TaskEntity - the copy operation runs asynchronously": "TaskEntityを返します - コピー操作は非同期で実行されます",
  "Copy modes:": "コピーモード:",
  "`DataCopyMode.ALL`: Copies all master data under the setting": "`DataCopyMode.ALL`: 設定下のすべてのマスターデータをコピー",
  "`DataCopyMode.PARTIAL`: Copies only specified IDs": "`DataCopyMode.PARTIAL`: 指定されたIDのみをコピー",
  "MasterDataService": "マスターデータサービス",
  "The MasterDataService service provides methods to manage master data and operations. This includes listing, retrieving, creating, updating, and deleting data, as well as checking for the existence of specific codes.": "MasterDataService サービスは、マスターデータと操作を管理するためのメソッドを提供します。これには、リスト、取得、作成、更新、削除、および特定のコードの存在確認が含まれます。",
  "Lists master data based on the provided search criteria.": "指定された検索条件に基づいてマスターデータをリストします。",
  "Get a master data by pk and sk.": "主キー (pk) およびソートキー (sk) によるマスターデータの取得。",
  "Creates a new master data entity": "新しいマスターデータエンティティを作成します。",
  "Updates existing master data.": "既存のマスターデータを更新します。",
  "Deletes specific master data based on the provided key.": "指定されたキーに基づいて特定のマスターデータを削除します。",
  "Checks if a specific code exists within the given tenant and type.": "指定されたテナントとタイプ内で特定のコードが存在するかどうかを確認します。",
  "Searches master data in RDS with filtering and pagination. This method is used when Prisma service is configured.": "フィルタリングとページネーションでRDS内のマスターデータを検索します。このメソッドはPrismaサービスが設定されている場合に使用されます。",
  "Exact match for master type code": "マスタータイプコードの完全一致",
  "Partial match (case-insensitive) for name": "名前の部分一致（大文字小文字を区別しない）",
  "Partial match (case-insensitive) for master code": "マスターコードの部分一致（大文字小文字を区別しない）",
  "Search Parameters": "検索パラメータ",
  "Parameter": "パラメータ",
  "Required": "必須",
  "Match Type": "マッチタイプ",
  "No": "いいえ",
  "Exact match": "完全一致",
  "Filter by master type code (masterTypeCode)": "マスタータイプコード（masterTypeCode）でフィルタ",
  "Partial match (case-insensitive)": "部分一致（大文字小文字を区別しない）",
  "Filter by name field": "名前フィールドでフィルタ",
  "Filter by master code": "マスターコードでフィルタ",
  "Page number (default: 1)": "ページ番号（デフォルト: 1）",
  "Items per page (default: 10)": "1ページあたりの項目数（デフォルト: 10）",
  "Sort order (default: [\"seq\", \"masterCode\"])": "ソート順（デフォルト: [\"seq\", \"masterCode\"]）",
  "Filter by deletion status": "削除ステータスでフィルタ",
  "Known Issue (Fixed in v1.0.17)": "既知の問題（v1.0.17で修正済み）",
  "In versions prior to v1.0.17, the `settingCode` parameter incorrectly used partial matching (`contains`) instead of exact matching. This caused unintended search results - for example, searching for \"PRODUCT\" would also return \"PRODUCT_TYPE\" and \"MY_PRODUCT\".": "v1.0.17より前のバージョンでは、`settingCode` パラメータが誤って完全一致ではなく部分一致（`contains`）を使用していました。これにより意図しない検索結果が返される問題がありました。例えば、「PRODUCT」を検索すると「PRODUCT_TYPE」や「MY_PRODUCT」も返されていました。",
  "If you are using v1.0.16 or earlier and need exact matching for `settingCode`, upgrade to v1.0.17 or later.": "v1.0.16以前をご使用で、`settingCode` の完全一致が必要な場合は、v1.0.17以降にアップグレードしてください。",
  "See also:": "参照：",
  "Changelog v1.0.17": "変更履歴 v1.0.17",
  "Retrieves detailed master data including related information. Throws NotFoundException if not found.": "関連情報を含む詳細なマスターデータを取得します。見つからない場合はNotFoundExceptionをスローします。",
  "Creates a new master data entity with automatic sequence generation if not provided.": "新しいマスターデータエンティティを作成します。シーケンスが指定されていない場合は自動生成されます。",
  "Creates multiple master data entities in bulk.": "複数のマスターデータエンティティを一括作成します。",
  "Updates an existing master data entity.": "既存のマスターデータエンティティを更新します。",
  "Deletes a master data entity by key.": "キーでマスターデータエンティティを削除します。"
}
