{
  "Sequence setup and usage.": "",
  "Sequence": "",
  "Purpose": "このサービスの目的は、システム内で動的なシーケンスを管理することです。",
  "`SequenceModule`  is a service for managing dynamic sequences in the system using DynamoDB as the primary database.": "`SequenceModule` は、DynamoDB を主要なデータベースとして使用してシステム内で動的なシーケンスを管理するためのサービスです。",
  "This service is designed to:": "このサービスは次の目的で設計されています:",
  "Generate unique sequence numbers based on parameters such as sequence type, tenant, or date.": "シーケンスタイプ、テナント、日付などのパラメータに基づいて一意なシーケンス番号を生成します。",
  "Automatically reset sequences based on cycles like:": "次のようなサイクルに基づいてシーケンスを自動的にリセットします:",
  "Daily.": "毎日。",
  "Monthly.": "毎月。",
  "Yearly.": "毎年。",
  "Fiscal Yearly.": "会計年度単位。",
  "Format sequence numbers according to specific system requirements (e.g., TODO-PERSONAL-72-001).": "システムの特定の要件に従ってシーケンス番号をフォーマットします（例: TODO-PERSONAL-72-001）。",
  "Ensure data consistency and integrity in multi-tenant systems.": "マルチテナントシステムでのデータの整合性と完全性を確保します。",
  "Usage": "使用方法",
  "The solution for customizing the behavior of the `SequenceModule` is to pass it an options `object` in the static `register()` method. The options object is only contain one property:": "`SequenceModule` の動作をカスタマイズする解決策は、静的な `register()` メソッドでオプションの `object` を渡すことです。オプションオブジェクトには、1 つのプロパティのみが含まれています。",
  "`enableController`: enable or disable default sequence controller.": "`enableController`: デフォルトのシーケンスコントローラーを有効または無効にします。",
  "We will create a simple example demonstrating how to use the sequence module and customize authentication for the sequence controller.": "シーケンスモジュールの使用方法とシーケンスコントローラーの認証をカスタマイズする方法を示す簡単な例を作成します。",
  "Beside controller, we can directly use `SequenceService` to generating sequence by injecting service.": "コントローラーのほかに、`SequenceService` を直接使用してサービスを注入することでシーケンスを生成できます。",
  "The `SequenceService` have only one public method:": "SequenceService には 1 つのパブリックメソッドがあります。",
  "Generates a new sequence based on the parameters provided in the GenSequenceDto object.": "GenSequenceDto オブジェクトで提供されたパラメータに基づいて新しいシーケンスを生成します。",
  "Parameters": "パラメータ",
  "`dto: GenSequenceDto`": "`dto: GenSequenceDto`",
  "The data transfer object that customizes the behavior of the sequence generation. Its properties include:": "シーケンス生成の動作をカスタマイズするデータ転送オブジェクトです。そのプロパティには以下が含まれます:",
  "`date?: Date`": "",
  "Default: Current date.": "デフォルト: 現在の日付。",
  "Description: Specifies the date for which the sequence is generated.": "説明: シーケンスが生成される日付を指定します。",
  "`rotateBy?: RotateByEnum`": "`rotateBy?: RotateByEnum`",
  "Default: none.": "デフォルト: なし。",
  "Options": "オプション",
  "fiscal_yearly": "",
  "yearly": "",
  "monthly": "",
  "daily": "",
  "none": "",
  "Description: Determines the rotation type for the sequence.": "説明: シーケンスの回転タイプを決定します。",
  "`tenantCode: string`": "`tenantCode: string`",
  "Required: Yes.": "必須: はい。",
  "Description: Identifies the tenant and type code for the intended usage.": "説明: テナントと用途のタイプコードを識別します。",
  "`params: SequenceParamsDto`": "`params: SequenceParamsDto`",
  "Description: Defines parameters to identify the sequence.": "説明: シーケンスを識別するためのパラメータを定義します。",
  "`format?: string`": "`format?: string`",
  "Default: %%no%%.": "デフォルト: %%no%%。",
  "Description: Specifies a custom format for the sequence. Example format:": "シーケンスのカスタムフォーマットを指定します。例: ",
  "`startMonth?: number`": "",
  "Default: 4 (April).": "デフォルト: 4（4月）。",
  "Description: Specifies the starting month of the fiscal year.": "説明: 会計年度の開始月を指定します。",
  "`registerDate?: Date`": "",
  "Default: Not specified.": "デフォルト: 未指定。",
  "Description: Calculates the fiscal period based on the provided date.": "説明: 提供された日付に基づいて会計期間を計算します。"
}