{
  "Learn how to implement AWS Step Functions for workflow orchestration in the MBC CQRS Serverless framework.": "MBC CQRS ServerlessフレームワークにおけるAWS Step Functionsを使用したワークフローオーケストレーションの実装方法を学びます。",
  "Step Functions": "Step Functions",
  "AWS Step Functions provides serverless workflow orchestration for coordinating distributed applications. In the MBC CQRS Serverless framework, Step Functions are used for:": "AWS Step Functionsは、分散アプリケーションを調整するためのサーバーレスワークフローオーケストレーションを提供します。MBC CQRS Serverlessフレームワークでは、Step Functionsは以下の目的で使用されます：",
  "System Configuration Example": "システム構成例",
  "The following diagram shows how Step Functions integrate with other AWS services in a typical production environment:": "以下の図は、一般的な本番環境でStep FunctionsがどのようにAWSサービスと統合されるかを示しています：",
  "Data Flow Example": "データフローの例",
  "Here is a typical data flow for a command execution with Step Functions:": "Step Functionsを使用したコマンド実行の一般的なデータフローは以下の通りです：",
  "CDK Implementation Examples": "CDK実装例",
  "Complete Command State Machine": "完全なコマンドステートマシン",
  "The following CDK code shows how to create a complete command handler state machine:": "以下のCDKコードは、完全なコマンドハンドラーステートマシンの作成方法を示しています：",
  "Task State Machine with Controlled Concurrency": "制御された並行性を持つタスクステートマシン",
  "Distributed Map for CSV Import": "CSVインポート用のDistributed Map",
  "For processing large CSV files, use Distributed Map which provides native S3 integration:": "大規模CSVファイルの処理には、ネイティブS3統合を提供するDistributed Mapを使用します：",
  "Event Source Configuration": "イベントソース設定",
  "Configure DynamoDB Streams and SQS to trigger Step Functions:": "DynamoDB StreamsとSQSを設定してStep Functionsをトリガーします：",
  "Long-running workflow orchestration": "長時間実行ワークフローのオーケストレーション",
  "Saga pattern implementation for distributed transactions": "分散トランザクションのためのSagaパターン実装",
  "Parallel batch processing with Distributed Map": "Distributed Mapを使用した並列バッチ処理",
  "Asynchronous task coordination with callback patterns": "コールバックパターンを使用した非同期タスク調整",
  "Architecture Overview": "アーキテクチャ概要",
  "State Machines": "ステートマシン",
  "The framework provides three pre-configured state machines:": "フレームワークは3つの事前設定済みステートマシンを提供します：",
  "Command State Machine": "コマンドステートマシン",
  "Handles data synchronization workflows with version control and parallel processing.": "バージョン管理と並列処理を伴うデータ同期ワークフローを処理します。",
  "Key features:": "主な機能：",
  "**Version checking**: Ensures command ordering and prevents conflicts": "**バージョンチェック**：コマンドの順序を保証し、競合を防止",
  "**Async callback**: Waits for previous commands using task tokens": "**非同期コールバック**：タスクトークンを使用して前のコマンドを待機",
  "**Parallel sync**: Uses Map state to sync data across multiple targets": "**並列同期**：Map状態を使用して複数のターゲットにデータを同期",
  "**TTL management**: Automatically sets expiration on records": "**TTL管理**：レコードの有効期限を自動設定",
  "Task State Machine": "タスクステートマシン",
  "Executes parallel sub-tasks with controlled concurrency.": "制御された並行性で並列サブタスクを実行します。",
  "**Controlled concurrency**: Limits parallel executions (default: 2)": "**制御された並行性**：並列実行を制限（デフォルト：2）",
  "**Status tracking**: Real-time task status updates": "**ステータス追跡**：リアルタイムのタスクステータス更新",
  "**Error handling**: Automatic failure detection and reporting": "**エラーハンドリング**：自動的な障害検出とレポート",
  "Import CSV State Machine": "CSVインポートステートマシン",
  "Processes large CSV files using AWS Distributed Map for massive parallelism.": "AWS Distributed Mapを使用して大規模なCSVファイルを大規模並列処理します。",
  "**S3 native integration**: Reads CSV directly from S3": "**S3ネイティブ統合**：S3から直接CSVを読み取り",
  "**Batch processing**: Groups rows for efficient processing": "**バッチ処理**：効率的な処理のために行をグループ化",
  "**High concurrency**: Supports up to 50 concurrent batch processors": "**高並行性**：最大50の同時バッチプロセッサをサポート",
  "**EXPRESS execution**: Uses express workflows for child state machines": "**EXPRESS実行**：子ステートマシンにExpressワークフローを使用",
  "Implementation Guide": "実装ガイド",
  "Step 1: Infrastructure Setup": "ステップ1：インフラストラクチャのセットアップ",
  "The framework automatically provisions Step Functions infrastructure using AWS CDK. Key resources include:": "フレームワークはAWS CDKを使用してStep Functionsインフラストラクチャを自動的にプロビジョニングします。主要なリソースは以下の通りです：",
  "Step 2: Define Step Function Events": "ステップ2：Step Functionイベントの定義",
  "Create event classes that extend the base Step Function event:": "基本のStep Functionイベントを拡張するイベントクラスを作成します：",
  "Step 3: Implement Event Handlers": "ステップ3：イベントハンドラーの実装",
  "Create handlers that process Step Function events:": "Step Functionイベントを処理するハンドラーを作成します：",
  "Step 4: Configure Event Factory": "ステップ4：イベントファクトリーの設定",
  "Register your Step Function events in the event factory:": "イベントファクトリーにStep Functionイベントを登録します：",
  "Step 5: Trigger State Machine Execution": "ステップ5：ステートマシン実行のトリガー",
  "Start a state machine execution from your service:": "サービスからステートマシン実行を開始します：",
  "Use Cases": "ユースケース",
  "Use Case 1: Data Synchronization": "ユースケース1：データ同期",
  "Synchronize data across multiple tables with version control and conflict resolution.": "バージョン管理と競合解決を伴う複数テーブル間のデータ同期。",
  "Scenario": "シナリオ",
  "When a command is created, sync the data to multiple read models.": "コマンドが作成されると、データを複数のリードモデルに同期します。",
  "Use Case 2: Batch Task Processing": "ユースケース2：バッチタスク処理",
  "Execute multiple related tasks in parallel with controlled concurrency.": "制御された並行性で複数の関連タスクを並列実行します。",
  "Process multiple items in a batch job with status tracking.": "ステータス追跡を伴うバッチジョブで複数のアイテムを処理します。",
  "Use Case 3: Large-Scale CSV Import": "ユースケース3：大規模CSVインポート",
  "Import millions of rows from CSV files with distributed processing.": "分散処理でCSVファイルから数百万行をインポートします。",
  "Import a large CSV file from S3 with validation and transformation.": "バリデーションと変換を伴うS3からの大規模CSVファイルのインポート。",
  "Use Case 4: Async Callback Pattern": "ユースケース4：非同期コールバックパターン",
  "Wait for external events using task tokens.": "タスクトークンを使用して外部イベントを待機します。",
  "Wait for approval before proceeding with a workflow.": "ワークフローを続行する前に承認を待機します。",
  "Callback Patterns with Task Tokens": "タスクトークンを使用したコールバックパターン",
  "The framework implements callback patterns using AWS Step Functions task tokens for coordinating long-running workflows and waiting for external events.": "フレームワークは、長時間実行ワークフローの調整と外部イベントの待機のために、AWS Step Functionsタスクトークンを使用したコールバックパターンを実装しています。",
  "How Callback Patterns Work": "コールバックパターンの仕組み",
  "When a Step Function state uses the `WAIT_FOR_TASK_TOKEN` integration pattern, the execution pauses until an external process sends a success or failure response with the task token.": "Step Functionの状態が`WAIT_FOR_TASK_TOKEN`統合パターンを使用すると、外部プロセスがタスクトークンとともに成功または失敗のレスポンスを送信するまで実行が一時停止します。",
  "StepFunctionService Implementation": "StepFunctionService実装",
  "The `StepFunctionService` provides methods for starting executions and resuming paused workflows:": "`StepFunctionService`は、実行の開始と一時停止したワークフローの再開のためのメソッドを提供します：",
  "Start a new state machine execution": "Start a new state machine execution (新しいステートマシン実行を開始)",
  "Resume a paused execution using task token": "Resume a paused execution using task token (タスクトークンを使用して一時停止した実行を再開)",
  "Wrap output in the expected format for Lambda integration": "Wrap output in the expected format for Lambda integration (Lambda統合の期待されるフォーマットで出力をラップ)",
  "Version-Based Command Chaining": "バージョンベースのコマンドチェーン",
  "The command state machine uses callback patterns to ensure commands are processed in version order:": "コマンドステートマシンは、コマンドがバージョン順に処理されることを保証するためにコールバックパターンを使用します：",
  "Wait for previous command to complete using task token": "Wait for previous command to complete using task token (タスクトークンを使用して前のコマンドの完了を待機)",
  "Store task token in DynamoDB for later callback": "Store task token in DynamoDB for later callback (後のコールバックのためにタスクトークンをDynamoDBに保存)",
  "When a command finishes, check if next version is waiting": "When a command finishes, check if next version is waiting (コマンドが終了したら、次のバージョンが待機中かチェック)",
  "No next command, chain ends": "No next command, chain ends (次のコマンドなし、チェーン終了)",
  "Resume the waiting command": "Resume the waiting command (待機中のコマンドを再開)",
  "CDK Configuration for Callback Pattern": "コールバックパターンのCDK設定",
  "Configure the state to wait for task token in your CDK stack:": "CDKスタックでタスクトークンを待機する状態を設定します：",
  "Create a state that waits for callback": "Create a state that waits for callback (コールバックを待機する状態を作成)",
  "Include task token in payload": "Include task token in payload (ペイロードにタスクトークンを含める)",
  "Use WAIT_FOR_TASK_TOKEN integration pattern": "Use WAIT_FOR_TASK_TOKEN integration pattern (WAIT_FOR_TASK_TOKEN統合パターンを使用)",
  "Long-Running Workflow Strategies": "長時間実行ワークフロー戦略",
  "The framework provides several strategies for handling long-running workflows:": "フレームワークは、長時間実行ワークフローを処理するためのいくつかの戦略を提供します：",
  "ZIP Import Orchestration": "ZIPインポートオーケストレーション",
  "For complex multi-file imports, the framework uses a hierarchical orchestration pattern:": "複雑なマルチファイルインポートの場合、フレームワークは階層的なオーケストレーションパターンを使用します：",
  "Task Token Propagation for Child Workflows": "子ワークフローへのタスクトークン伝播",
  "When triggering child workflows, the parent stores the task token for later callback:": "子ワークフローをトリガーする際、親は後のコールバックのためにタスクトークンを保存します：",
  "Trigger a child CSV job and wait for completion": "Trigger a child CSV job and wait for completion (子CSVジョブをトリガーし、完了を待機)",
  "Task token from parent workflow": "Task token from parent workflow (親ワークフローからのタスクトークン)",
  "Create CSV job with stored task token": "Create CSV job with stored task token (保存されたタスクトークンでCSVジョブを作成)",
  "Store for callback when CSV processing completes": "Store for callback when CSV processing completes (CSV処理完了時のコールバック用に保存)",
  "Workflow Timeout Configuration": "ワークフロータイムアウト設定",
  "Set appropriate timeouts for long-running workflows:": "長時間実行ワークフローに適切なタイムアウトを設定します：",
  "Overall workflow timeout": "Overall workflow timeout (全体のワークフロータイムアウト)",
  "Integration with Import/Export Patterns": "インポート/エクスポートパターンとの統合",
  "The framework integrates Step Functions with the import module for scalable data processing:": "フレームワークは、スケーラブルなデータ処理のためにStep Functionsをインポートモジュールと統合します：",
  "CSV Import Flow": "CSVインポートフロー",
  "The CSV import uses a two-phase approach with Step Functions:": "CSVインポートは、Step Functionsを使用した2フェーズアプローチを使用します：",
  "Phase 1: Create import job and trigger Step Function": "Phase 1: Create import job and trigger Step Function (フェーズ1：インポートジョブを作成しStep Functionをトリガー)",
  "Process directly in Lambda (for small files)": "Process directly in Lambda (for small files) (小さなファイルの場合、Lambdaで直接処理)",
  "Create job and let Step Function handle processing": "Create job and let Step Function handle processing (ジョブを作成し、Step Functionに処理を任せる)",
  "Phase 2: Step Function handler processes rows": "Phase 2: Step Function handler processes rows (フェーズ2：Step Functionハンドラーが行を処理)",
  "Count total rows and initialize job": "Count total rows and initialize job (合計行数をカウントし、ジョブを初期化)",
  "Process batch of rows": "Process batch of rows (行のバッチを処理)",
  "Progress Tracking with Atomic Counters": "アトミックカウンターによる進捗追跡",
  "The import service uses atomic DynamoDB counters for accurate progress tracking:": "インポートサービスは、正確な進捗追跡のためにDynamoDBのアトミックカウンターを使用します：",
  "Atomically increment progress counters": "Atomically increment progress counters (進捗カウンターをアトミックにインクリメント)",
  "Use atomic update expression": "Use atomic update expression (アトミック更新式を使用)",
  "Check if job is complete and update final status": "Check if job is complete and update final status (ジョブが完了したかチェックし、最終ステータスを更新)",
  "Processing Mode Selection": "処理モードの選択",
  "Choose the appropriate processing mode based on data size:": "データサイズに基づいて適切な処理モードを選択します：",
  "Processing Mode": "処理モード",
  "Use Case": "ユースケース",
  "Max Rows": "最大行数",
  "Concurrency": "並行性",
  "Small files, immediate feedback": "小さなファイル、即時フィードバック",
  "Single Lambda": "単一Lambda",
  "Large files, background processing": "大きなファイル、バックグラウンド処理",
  "Millions": "数百万",
  "Up to 50": "最大50",
  "Example: Selecting processing mode based on file size": "Example: Selecting processing mode based on file size (例：ファイルサイズに基づく処理モードの選択)",
  "Step Functions Context": "Step Functionsコンテキスト",
  "Every Step Function event includes context information about the execution:": "すべてのStep Functionイベントには、実行に関するコンテキスト情報が含まれます：",
  "Error Handling": "エラーハンドリング",
  "Implement robust error handling in your state machines:": "ステートマシンに堅牢なエラーハンドリングを実装します：",
  "Handler-Level Error Handling": "ハンドラーレベルのエラーハンドリング",
  "The framework provides built-in error handling patterns for Step Function handlers:": "フレームワークは、Step Functionハンドラー用の組み込みエラーハンドリングパターンを提供します：",
  "Command event handler with status tracking and error handling": "Command event handler with status tracking and error handling (ステータス追跡とエラーハンドリングを備えたコマンドイベントハンドラー)",
  "Update status to STARTED before processing": "Update status to STARTED before processing (処理前にステータスをSTARTEDに更新)",
  "Update status to FINISHED on success": "Update status to FINISHED on success (成功時にステータスをFINISHEDに更新)",
  "Update status to FAILED and publish alarm on error": "Update status to FAILED and publish alarm on error (エラー時にステータスをFAILEDに更新しアラームを発行)",
  "Task Error Handling with Continuation": "継続を伴うタスクエラーハンドリング",
  "For task handlers, the framework supports continuing execution even after errors:": "タスクハンドラーの場合、フレームワークはエラー後も実行を継続することをサポートします：",
  "Task handler with error handling that allows workflow continuation": "Task handler with error handling that allows workflow continuation (ワークフロー継続を許可するエラーハンドリング付きタスクハンドラー)",
  "Update status to COMPLETED on success": "Update status to COMPLETED on success (成功時にステータスをCOMPLETEDに更新)",
  "Update status to FAILED and publish alarm, but don't throw": "Update status to FAILED and publish alarm, but don't throw (ステータスをFAILEDに更新しアラームを発行するが、スローしない)",
  "Note: Error is not re-thrown to allow Step Function to continue": "Note: Error is not re-thrown to allow Step Function to continue (注：Step Functionの継続を許可するためエラーは再スローしない)",
  "Uncomment to fail the entire workflow on error": "Uncomment to fail the entire workflow on error (エラー時にワークフロー全体を失敗させる場合はコメント解除)",
  "Alarm Publishing": "アラーム発行",
  "The framework publishes alarms to SNS for monitoring and alerting:": "フレームワークは、監視とアラートのためにSNSにアラームを発行します：",
  "Publish alarm notification to SNS topic": "Publish alarm notification to SNS topic (SNSトピックにアラーム通知を発行)",
  "State machine error handling configuration:": "ステートマシンのエラーハンドリング設定：",
  "Best Practices": "ベストプラクティス",
  "Design Principles": "設計原則",
  "**Idempotency**: Design each state to be safely retryable": "**冪等性**：各状態を安全に再試行可能に設計",
  "**Single Responsibility**: Each state should do one thing well": "**単一責任**：各状態は一つのことをうまく行う",
  "**Timeout Configuration**: Set appropriate timeouts for each state": "**タイムアウト設定**：各状態に適切なタイムアウトを設定",
  "**Logging**: Enable comprehensive logging for debugging": "**ロギング**：デバッグのための包括的なロギングを有効化",
  "Performance Optimization": "パフォーマンス最適化",
  "**Use Express Workflows**: For high-volume, short-duration workflows": "**Expressワークフローを使用**：高ボリューム、短期間のワークフロー向け",
  "**Batch Processing**: Group items to reduce state transitions": "**バッチ処理**：状態遷移を減らすためにアイテムをグループ化",
  "**Concurrency Limits**: Set appropriate limits to prevent throttling": "**並行性制限**：スロットリングを防ぐための適切な制限を設定",
  "**S3 Integration**: Use native S3 integration for large data processing": "**S3統合**：大規模データ処理にはネイティブS3統合を使用",
  "Monitoring": "モニタリング",
  "**CloudWatch Metrics**: Monitor execution counts, failures, and duration": "**CloudWatchメトリクス**：実行回数、失敗、期間を監視",
  "**X-Ray Tracing**: Enable distributed tracing for debugging": "**X-Rayトレーシング**：デバッグのための分散トレーシングを有効化",
  "**CloudWatch Logs**: Capture detailed execution logs": "**CloudWatch Logs**：詳細な実行ログをキャプチャ",
  "**Alarms**: Set up alerts for failure rates and execution times": "**アラーム**：失敗率と実行時間に対するアラートを設定",
  "Related Documentation": "関連ドキュメント",
  "[Task Module](../tasks.md) - Task management with Step Functions": "[タスクモジュール](../tasks.md) - Step Functionsを使用したタスク管理",
  "[Import/Export Patterns](../import-export-patterns.md) - CSV import with Distributed Map": "[インポート/エクスポートパターン](../import-export-patterns.md) - Distributed Mapを使用したCSVインポート",
  "[Event Sourcing](./event-sourcing.md) - Event-driven architecture": "[イベントソーシング](./event-sourcing.md) - イベント駆動アーキテクチャ",
  "[CQRS Flow](./cqrs-flow.md) - Command and query separation": "[CQRSフロー](./cqrs-flow.md) - コマンドとクエリの分離"
}
